{
  "ybuwdjsb": "Quốc sử quán triều nguyễn, Đại Nam Thực Lục, Tập Ba, Đà Nẵng, 2007, 頁: ||page||",
  "4i4d9qv0": "Quốc sử quán triều nguyễn, Đại Nam Thực Lục, Tập Sáu, Đà Nẵng, 2007, 頁: ||page||",
  "o4z7mi1l": "Quốc sử quán triều nguyễn, Khâm định Đại Nam hội điển sự lệ, Tập 5, Huế, 1993, 頁: ||page||",
  "rce1jqt1": "Quốc sử quán triều nguyễn, 大南寔錄, 正編, 第二紀, 卷六七, 二十七, Huế, 1830",
  "phlru25j": "Quốc sử quán triều nguyễn, 大南寔錄, 正編, 第三紀, 卷五十五, 二十四, Huế, 1846",
  "c22rssui": "Quốc sử quán triều nguyễn, 欽定大南會典事例, 戸部錢法, 卷五十三, 七, Huế, 1837",
  "5wx9pyjr": "Jules Silvestre, Notes pour servir à la recherche et au classement des monnaies et médailles de l’Annam et de la Cochinchine française, Saigon, 1883, 頁: ||page||",
  "17pzm9pe": "Désiré Lacroix, Numismatique Annamite, Saigon, 1900, 頁: ||page||, フォトプレート: ||plate||",
  "jwb4rurt": "Albert Schroeder, Annam. Études Numismatiques, Paris, 1905, 頁: ||page||, フォトプレート: ||plate||",
  "54q4hlvb": "Stewart Lockhart, The Currency of the Farther East, Hong Kong, 1907, 頁: ||page||, フォトプレート: ||plate||",
  "5z3zorbi": "奥平昌洪, 東亜銭志 十六, 東京, 1938 頁: ||page||",
  "az3njd7x": "丁福保, 古錢大辭典, 天津, 1940, 頁: ||page||",
  "v793uyej": "Bernard J. Permar, Catalogue of Annam Coins, 968-1955, Saigon, 1963, 頁: ||page||, フォトプレート: ||plate||",
  "yi4abjp5": "Walter Lozoski, Coin of the Annam, 1963, 頁: ||page||",
  "cmw0q915": "John A. Novak, A Working Aid for Collectors of Annamese Coins, Longview, 1967, Trang: ||page||",
  "1ee3zir3": "三浦清吾, 安南錢譜, 大銭銀銭部, 東京, 1975, 頁: ||page||",
  "j7kz4y0u": "Đỗ Văn Ninh, Niên Biểu Việt Nam,Hà Nội, 1984, 頁: ||page||",
  "idu77whs": "François Thierry, Monnaies d’Extrême-Orient, II Vietnam Japon, Paris, 1986, 頁: ||page||, フォトプレート: ||plate||",
  "g24mcucr": "François Thierry, Catalogue des Monnaies Vietnamiennes, Paris, 1988, 頁: ||page||, フォトプレート: ||plate||",
  "f9ewv5w2": "Đỗ Văn Ninh, Tiền cổ Việt Nam, Hà Nội, 1992, Trang: ||page||, Phụ lục ảnh: ||plate||",
  "1nk3wolc": "云南省钱币研究会、广西钱币学, 越南历史货币, 北京, 1993, 頁: ||page||",
  "hq8n5n8z": "François Thierry, Catalogue des Monnaies Vietnamiennes, Supplément, Paris, 2002, 頁: ||page||",
  "tldlkhpc": "Phạm Quốc Quân, Nguyễn Đình Chiến, Cổ vật Việt Nam, Hà Nội, 2003, 頁: ||page||",
  "swn15bxv": "Dr. R. Allan Barker, The Historical Cash Coins of Việt Nam, Singapore, 2004, 頁: ||page||",
  "v42e5riq": "Lục Đức Thuận, Võ Quốc Ky, Tiền cổ Việt Nam, Đà Nẵng, 2009, 頁: ||page||",
  "jyvs7zwq": "大庫隆夫, 安南之大銭, 加古川市, 2010, 頁: ||page|| ",
  "rqdaou3y": "François Joyaux, Collections numismatiques H. et M. de Pirey. Monnaies d'Asie N°4, Nantes, 2011, 頁: ||page||",
  "oicprxpn": "満泉堂, 安南美号大銭図譜, 横浜, 2012, 頁: ||page||",
  "5zb2pigu": "François Joyaux, Collection numismatique Jules Silvestre. Monnaies d'Asie N°1, Nantes, 2012, 頁: ||page||",
  "twunhs0e": "Hoàng Anh Tuấn, Diệp Minh Cường, Sưu Tập Tiền Minh Mệnh Trong Bảo Tàng Thành Phố Hố Chí Minh, Hải Phòng, 2013, 頁: ||page||",
  "m0ngyzvr": "François Joyaux, Collection numismatique Jules Silvestre, Supplément. Monnaies d'Asie N°3, Nantes, 2014, 頁: ||page|| ",
  "vat3hloi": "David Hartill, A Guide to Cash Coins, London, 2017, 頁: ||page||",
  "yig5kfbi": "François Joyaux, Monnaies et numismates d'Indochine française, Paris, 2017, 頁: ||page||",
  "yo8nlu7d": "齋藤昭維, 安南美號大銭の研究 銅銭の部, 横浜, 2019, 頁: ||page||",
  "cyqlq7kf": "François Joyaux, Monnaies Impériales d’Annam, Monaco, 2019, 頁: ||page||",
  "h3381a7q": "François Joyaux, Collections numismatiques du Docteur Albert Sallet. Monnaies d'Asie N°14, Nantes, 2020, 頁: ||page||",
  "j3r599gy": "François Joyaux, Les Monnaies Asiatiques dans les Collections Publiques Françaises, Nantes, 2020, 頁: ||page||",
  "rprrp722": "Ngân hàng Nhà nước Việt Nam, Lịch Sử Đồng Tiền Việt Nam, Hà Nội, 2021, 頁: ||page||",
  "c4zw8o7a": "Eduardo Toda y Güell, Annam and its Minor Currency, Shanghai, 1882, 頁: ||page||",
  "52xcxi30": "Đỗ Văn Ninh, Tiền cổ thời Minh Mệnh, Nghiên cứu Lịch sử, Số 208, Hà Nội, 1983, 頁: ||page||",
  "zv1eosh2": "Đỗ Văn Ninh, Tiền cổ thời Thiệu Trị. Nghiên cứu Lịch sử, Số 215, Hà Nội, 1984, 頁: ||page||",
  "jgar9yls": "Đỗ Văn Ninh, Tiền cổ thời Tự Đức, Nghiên cứu Lịch sử, Số 216, Hà Nội, 1984, 頁: ||page||",
  "kb1powff": "H.W. Kempgen, Palastmünzen des Kaisers Minh Mang, Frankfurt, 1988, 頁: ||page||",
  "qcsd2clc": "François Thierry, Monnaies et circulation monétaire au Vietnam dans l'ère Tự Đức (1848-1883), Revue numismatique, 6e série, Tome 154, Paris, 1999, 頁: ||page||",
  "gf0h4vou": "François Thierry, La monnaie vietnamienne, entre tradition việt et culture han, Arts asiatiques, tome 61, Paris, 2006, 頁: ||page||",
  "gydjpz3m": "François Thierry, Une grande monnaie inconnue de Tự Đức, Bulletin de la Société Française de Numismatique, 65ᵉ année, N°9, Paris, 2010, 頁: ||page||",
  "rt5wnr81": "François Thierry, The Confucian Message on Vietnamese Coins, London, 2011, 頁: ||page|| ",
  "9f7oyhly": "Nguyễn Đình Chiến, Trương Văn Thắng, Vietnam Numismatics, Số 3, TP. Hồ Chí Minh, 2018, Trang: ||page||",
  "d3ajayqe": "Nguyễn Đình Chiến, Trương Văn Thắng, Vietnam Numismatics, Tập 4, TP. Hồ Chí Minh, 2018, 頁: ||page||",
  "3zf74hz4": "Nguyễn Đình Chiến, Trương Văn Thắng, Vietnam Numismatics, Tập 5, TP. Hồ Chí Minh, 2018, 頁: ||page||",
  "n2u0xpv3": "Nguyễn Đình Chiến, Trương Văn Thắng, Vietnam Numismatics, Tập 6, TP. Hồ Chí Minh, 2019, 頁: ||page||",
  "jr0pbas5": "郭若愚, 略说安南 明命 绍治 嗣德 三种美号当陌钱郭若愚, 中國钱币, 1996-4, 北京, 1996, Trang: ||page||",
  "0px1q3we": "François Thierry, Armor Numis Hors série 2008, Saint-Sébastien-sur-Loire, 2008, Trang: ||page||",
  "kspdu1yv": "Bảo tàng Thành phố Hồ Chí Minh, Tiền thưởng (đại tiền) thời Minh Mạng (1830)",
  "qre23c4s": "Bảo tàng Thành phố Hồ Chí Minh, Tiền thưởng (đại tiền) thời Thiệu Trị (1846)",
  "zz0pfqdx": "Bảo tàng Thành phố Hồ Chí Minh, Tiền thưởng (đại tiền) thời Tự Đức (1848-1883)",
  "is4ltgfl": "Bảo Tàng Lịch Sử Quốc Gia, Tiền thưởng triều Nguyễn",
  "wzrb21p7": "The British Museum, Coins and Medals Department",
  "1llepxbk": "Musée Missions étrangères de Paris",
  "zght3xer": "Bibliothèque Nationale de France, Département des monnaies, médailles et antiques",
  "0iyvz089": "Musée Monnaie de Paris",
  "432ervgx": "Musée Dobrée de Nantes",
  "rrrau0dv": "张帆, 越南美号大铜钱初探, 北京, 2020"
}